
//  ===================================================================================================

//  1. conditional(조건문)

//  조건문에서 if 는 true나 false로 이루어진 boolean 값에 따라 값이 true인 경우를 찾아 실행 시키는 명령어.
//  만약 true인 값이 없을 경우 임의로 설정한 else문에 있는 코드가 실행됨.

//  ===================================================================================================

//  2. And 와 Or 연산자

// AND: && 로 표현한다.
//  a && b에서 양쪽 값 중 하나라도 false 이면 false값으로,
//  둘 다 true를 충족시켜야 true값이 된다.

//  OR: ||(Shift + enter키 위에 있는 (원)사인)로 표현
//  a || b 의 경우 둘 중 하나라도 true값인 경우 결과 값은 true가 된다.
//  둘 다 false 일 때만 결과값 false

//  ===================================================================================================

//  '='  => value를 할당해줌.
// '==='  => ex) a === b / a와 b가 같은가?
//  '!=='  => ex) a !== b / a와 b가 같지 않은가?

//  ===================================================================================================